<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Manual del Col&middot;lex</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />

<link rel="stylesheet" href="print.css" media="print">
<link rel="stylesheet" href="estil.css" media="screen">

        <!--[if lt IE 7.]>
            <script defer type="text/javascript" src="js/pngfix.js"></script>
        <![endif]-->
</head>
<body>
	<div id="imatge">
		<img src="img/collex_beta.png" alt="COL·LEX MANUAL" width="266" height="134" title ="COL·LEX MANUAL" /> 
			  <div id="menulat">
			    <UL>
				<li><a href="intro.html">1. Introducci&oacute;</a></li>
			  	<li><a href="conceptes.html">2. Conceptes clau</a></li>
				<li><a href="colleccions.html">3. Col&middot;leccions</a></li>
					<oL>
						<li><a href="colleccions.html#crear">3.1 Crear una col&middot;lecci&oacute; nova</a></li>
						<li><a href="colleccions.html#editar">3.2 Editar una col&middot;lecci&oacute; ja creada</a></li>
						<li><a href="colleccions.html#obrir">3.3 Obrir una col&middot;lecci&oacute; </a></li>
						<li><a href="colleccions.html#importar">3.4 Importar una col&middot;lecci&oacute;</a></li>
						<li><a href="colleccions.html#esborrar">3.5 Esborrar una col&middot;lecci&oacute;</a></li>
					</oL>
				<li><a href="fitxes.html">4. Fitxes</a></li>
					<oL>
						<li><a href="fitxes.html#crear">4.1 Crear una fitxa nova</a></li>
						<li><a href="fitxes.html#editar">4.2 Editar una fitxa</a></li>
						<li><a href="fitxes.html#eliminar">4.2 Eliminar una fitxa</a></li>
						<li><a href="fitxes.html#imprimir">4.3 Imprimir una fitxa</a></li>
					</oL>
				<li><a href="cerques.html">5. Cercar fitxes</a></li>
				<li><a href="intercanvi.html">6. Intercanvi de fitxes i col&middot;leccions</a></li>
				<li><a href="grup.html">7. Opcions de treball en grup </a></li>
				<li><a href="condicions.html">8. Condicions d'&uacute;s</a></li>
				<li><a href="contacte.html">9. Contacte</a></li>
				<li><a href="credits.html">10. Cr&egrave;dits</a></li>
	  			</UL>
	  </div>
			<div class="invisible">    <h2><u>col&middot;lex manual </u></h2>
			</div>
	</div>

	<div id="TEXT">
  	
		<div id="menu">
			<li><a href="intro.html">introducci&oacute;</a></li>
			<li><a href="conceptes.html">conceptes clau</a></li>
			<li><a href="colleccions.html">col&middot;leccions</a></li>
			<li><a href="fitxes.html">fitxes</a></li>
			<li><a href="cerques.html">cercar fitxes</a></li>
			<li><a href="intercanvi.html">intercanvi de fitxes i col&middot;leccions</a></li>
			<li><a href="grup.html">treball en grup</a></li>
			<li><a href="condicions.html">condicions d'&Uacute;s</a></li>
			<li><a href="contacte.html">Contacte</a></li>
			<li class="ultim"><a href="credits.html">Cr&egrave;dits</a></li>
		</div>
	
		<div id="content">
		  <h2><a name="_Toc149030481" id="_Toc149030481">Conceptes clau</a></h2>
      <p>&nbsp;</p>
      <h3><a name="_Toc149030482" id="_Toc149030482">Col&middot;leccions</a></h3>
      <p>Una col&middot;lecci&oacute;, o base de dades, et permetr&agrave; tenir informaci&oacute; endre&ccedil;ada en fitxes per qu&egrave; pugui ser recuperada en qualsevol moment, de manera senzilla i f&agrave;cil.</p>
      <p>Per entendre com funciona el Col&middot;lex, utilitzarem l'exemple: &quot;Companys de classe&quot;.</p>
      <p>Dins aquesta col&middot;lecci&oacute;, es creen camps, <strong></strong> o caracter&iacute;stiques, que determinen quines dades vols saber de cada un dels teus companys, com poden ser: &ldquo;Nom&rdquo;, &ldquo;Aniversari&rdquo;, &ldquo;Tel&egrave;fon&rdquo;, &ldquo;Foto&rdquo; , &ldquo;Email&rdquo;, &ldquo;Grup de m&uacute;sica preferit&rdquo;...</p>
      <p>&nbsp;</p>
      <h3><a name="_Toc149030483" id="_Toc149030483">Fitxes</a></h3>
      <p>Les fitxes s&oacute;n les diferents entrades de la col&middot;lecci&oacute;. Cada fitxa &eacute;s diferent a les altres i correspon a un &uacute;nic membre o element de la col&middot;lecci&oacute;. Aix&iacute;, seguint l&rsquo;exemple de la col&middot;lecci&oacute; &ldquo;Companys de classe&rdquo;, cada estudiant tindr&agrave; una fitxa &uacute;nica amb la seva informaci&oacute; personal definida segons un seguit de camps.</p>
      <p>&nbsp;</p>
      <h3><a name="camps" id="camps">Camps</a></h3>
      <p>Els camps corresponen a les caracter&iacute;stiques de cada membre de la col&middot;lecci&oacute; i et permetran localitzar la informaci&oacute; r&agrave;pidament segons la manera com els hagis ordenat o mitjan&ccedil;ant diferents criteris de cerca. Com podr&agrave;s veure m&eacute;s endavant, hi ha diferents tipus de camps: de text, nombres, dates, imatges...</p>
      <p>Totes les fitxes d&rsquo;una col&middot;lecci&oacute; tenen els mateixos camps, els quals es trien en crear la col&middot;lecci&oacute;. En tot moment, podr&agrave;s canviar el nom del camp i les propietats, ara b&eacute;, cal que tinguis en compte que el tipus no el podr&agrave;s modificar un cop ja l&rsquo;hagis definit per primera vegada. </p>
      <p>Els tipus de camps que el Col&middot;lex t&rsquo;ofereix s&oacute;n els seg&uuml;ents:</p>
      <p>&nbsp;</p>
      <p><strong>Text</strong>: En aquest tipus de camp cal que delimitis el nombre m&agrave;xim de lletres que hi podr&agrave;s posar, per exemple: &quot;Nom&quot;.</p>
      <p>&nbsp;</p>
      <p><strong>Nombre enter</strong>: S&oacute;n nombres sense decimals. Cal que delimitis entre quines xifres, m&iacute;nima i m&agrave;xima, es pot definir la quantitat. Tamb&eacute; es pot definir el seu valor per defecte i amb quina unitat de mesura vols que aparegui. Aquests nombres poden ser positius o negatius.</p>
      <p>Ex.: &ldquo;Germans&rdquo; =  2: no es pot tenir 1&rsquo;2 germans ni 3&rsquo;4 i, en aquest cas, no t&eacute; unitats.</p>
      <p>&nbsp;</p>
      <p><strong>Nombre decimal</strong>: Cal que delimitis entre quines xifres decimals, m&iacute;nima i m&agrave;xima, es pot definir la quantitat. Tamb&eacute; es pot definir el seu valor per defecte, i amb quina unitat de mesura vols que aparegui. Aquests nombres poden ser positius o negatius.</p>
      <p>Ex.: En el cas d'una noia que fes 1,68 metres a &quot;Al&ccedil;ada&rdquo; podries posar 1 i 2, com a m&iacute;nim i m&agrave;xim, i la unitat seria metres.</p>
      <p>&nbsp;</p>
      <p><strong>Imatge</strong>: Una imatge que il&middot;lustri la fitxa et pot ser molt efica&ccedil; per recon&egrave;ixer millor la informaci&oacute;. Pots indicar l&rsquo;al&ccedil;ada i l'amplada m&agrave;xima amb qu&egrave; es visualitzaran les imatges a la pantalla. Pots introduir fitxers dels tipus: JPG, JPEG, PNG i TIFF.</p>
      <p>&nbsp;</p>
      <p><strong>So</strong>: Pots afegir un so relacionat amb la fitxa, com la veu d&rsquo;un dels teus amics, el so d&rsquo;un animal... El fitxer cal que sigui del tipus MP3.</p>
      <p>&nbsp;</p>
      <p><strong>Data</strong>: Et permet posar la data d&rsquo;algun fet relacionat amb la fitxa. Les dates contenen el dia, el mes i l'any.</p>
      <p>Ex.: El camp &quot;Data de naixement&rdquo;, serveix per guardar el dia, el mes i l'any en qu&egrave; va n&egrave;ixer el company de classe. Si el que dessitges &eacute;s guardar nom&eacute;s l'any de naixement cal que utilitzis un camp de tipus enter.</p>
      <p>&nbsp;</p>
      <p><strong>Boole&agrave; </strong>(S&iacute;/No): Serveix per indicar propietats que nom&eacute;s poden ser certes o falses. Per exemple, si poses a la teva col&middot;lecci&oacute; de companys de classe el camp &ldquo;Porta ulleres&rdquo; i el defineixes com a boole&agrave;, determinar&agrave;s que nom&eacute;s hi hagi dues opcions: que en dugui o que no en dugui, &eacute;s a dir, que l&rsquo;afirmaci&oacute; &eacute;s veritable o falsa. </p>
      <p>Ex.: Porta ulleres 
        <input type="checkbox"/>
      <strong></strong>(No en porta)</p>
      <p> Ex.: Porta ulleres 
        <input type="checkbox" checked="checked"/>
      (S&iacute; que en porta)<strong></strong></p>
      <p>&nbsp;</p>
      <h3><a name="_Toc149030485" id="_Toc149030485">Estructura</a></h3>
      <p>L&rsquo;estructura d&rsquo;una col&middot;lecci&oacute; est&agrave; formada per tots els camps que has definit en una col&middot;lecci&oacute;. Si exportes l&rsquo;estructura d&rsquo;una col&middot;lecci&oacute; que has creat i la passes a un altre company/a, el Col&middot;lex us permetr&agrave; compartir fitxes d&rsquo;aquesta col&middot;lecci&oacute;, ja que l&rsquo;estructura ser&agrave; la mateixa.</p>
      <p>En aquest exemple, pots recon&egrave;ixer les diferents parts de la col&middot;lecci&oacute; i els diferents tipus de camps.</p>
      <p><strong>Col&middot;lecci&oacute;: Companys de classe</strong></p>
      <p><strong>Fitxa: N&uacute;mero 1</strong></p>
      <p><strong>&nbsp;</strong></p>

		<table border="1px" style="width:80%; margin-left: 60px; ">
		<tr>
			<th></th>
			<th><div align="left">Tipus de camp</div></th>
		</tr>
		<tr>
			<td><strong>Nom</strong>: Maria P&eacute;rez</td>
			<td>Text</td>
		</tr>
		<tr>
			<td><strong>Data de naixement</strong>: 26-02-1981</td>
			<td>Data</td>
		</tr>
		<tr>
			<td><strong>Al&ccedil;ada</strong>: 1&rsquo;70 metres</td>
			<td>Decimal</td>
		</tr>
		<tr>
			<td><strong>Nombre de germans</strong>: 3</td>
			<td>Enter</td>
		</tr>
		<tr>
			<td><strong>Adre&ccedil;a</strong>: C/del Pou,22</td>
			<td>Text</td>
		</tr>
		<tr>
			<td><strong>Grup preferit</strong>: Els pets</td>
			<td>Text</td>
		</tr>
		<tr>
			<td><strong>Porta ulleres</strong>:<strong> 
			  <input type="checkbox" checked="checked"/>
		    <strong></strong></strong></td>
			<td>Boole&agrave;</td>
		</tr>
		<tr>
			<td><strong>Foto</strong>:


            <img src="img/fotoExemple.jpg" width="107" height="136" align="right" /></td>
			<td>Imatge</td>
		</tr>
		</table>	

      <p>&nbsp;</p>
      <p>Trobar&agrave;s altres col&middot;leccions d&rsquo;exemple a la portada del Col&middot;lex.</p>
      <p>Ara que ja pots entendre millor com funcionen les col&middot;leccions, pots comen&ccedil;ar a crear-ne la teva.</p>
      <p>&nbsp;</p>
</div>
	

</body>
</html>
